# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов.
# Вместе они сделали S журавликов. Сколько журавликов сделал
# каждый ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

# S = 8

# print("Всего сделали", S, "Журавликов")
# print("Из", S, "Журавликов Петя сделал", s/8, "Катя сделала", s/8*4, "Сережа сделал", s/8 )

s = 70
print('Петя и Сережа сделали по', s/7, 'журавликов')
print('Маша сделала ', s/7*4, 'журавликов') 